config.org
#+title: Config

* Table of Contents :toc:
- [[#default-config][Default Config]]
- [[#keymaps][Keymaps]]
- [[#doom-settings][Doom Settings]]
- [[#org-stuff][Org stuff]]
- [[#wayland-clipboard][Wayland Clipboard]]
- [[#keep-tramp-connection-alive][Keep TRAMP Connection Alive]]
- [[#corfu][Corfu]]
- [[#dashboard][Dashboard]]
- [[#evil-options][Evil Options]]
- [[#lsp-mode-optimization][LSP Mode Optimization]]
- [[#solaire-mode][Solaire Mode]]
- [[#ui-tweaks][UI Tweaks]]

* Default Config
#+begin_src emacs-lisp
(setq user-full-name "Omar Mohamed"
      user-mail-address "omarcoptan9@gmail.com")

(add-to-list 'auto-mode-alist '("\\.ya?ml\\'" . yaml-mode))
#+end_src

* Keymaps
#+begin_src emacs-lisp
(map! :leader
      :desc "Yank to clipboard"           "y" "\"+y"
      :desc "Delete to clipboard"         "d" "\"+d")

(evil-define-key 'insert global-map (kbd "C-v") 'clipboard-yank)

(map! :leader
      (:prefix ("t" . "Toggle")
       :desc "Toggle vterm split"         "v" #'+vterm/toggle
       :desc "Toggle treemacs"            "t" #'+treemacs/toggle
       :desc "Toggle eshell"              "e" #'+eshell/toggle))

(map! :leader
      (:prefix ("o" . "Open")
       :desc "Open vterm here"            "v" #'+vterm/here
       :desc "Open eshell here"           "e" #'+eshell/here))
#+end_src

* Doom Settings
#+begin_src emacs-lisp
;; (setq doom-theme 'tron-legacy) ;; doom theme
(setq doom-theme 'doom-nord) ;; doom theme
(setq doom-font (font-spec :family "IBM Plex Mono" :size 16)) ;; doom font
(setq display-line-numbers-type 'relative) ;; relative numbers
(setq confirm-kill-emacs nil) ;; don't confirm on emacs exit

(when (eq system-type 'android)
  (setq explicit-shell-file-name "/data/data/com.termux/files/usr/bin/fish")
  (setq vterm-shell "/data/data/com.termux/files/usr/bin/fish"))
#+end_src

* Dired
#+begin_src emacs-lisp
(after! dired
  (add-hook 'dired-mode-hook #'nerd-icons-dired-mode))
#+end_src

* Org stuff
#+begin_src emacs-lisp
(setq org-directory "~/docs/notes/org/")
(setq org-modern-table-vertical 1)
(setq org-modern-table t)
(add-hook 'org-mode-hook #'hl-todo-mode)
(add-hook 'org-mode-hook (lambda() (org-bullets-mode 1)))
#+end_src

* Wayland Clipboard
#+begin_src emacs-lisp
(when (getenv "WAYLAND_DISPLAY")
  ;; Fix "The kill is not a (set of) trees" and clipboard hangs on PGTK/Wayland
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))
  ;; Ensure the coding system is strictly UTF-8 for clipboard operations
  (set-selection-coding-system 'utf-8))
#+end_src

* Keep TRAMP Connection Alive
#+begin_src emacs-lisp
(setq tramp-use-ssh-controlmaster-options nil)
(customize-set-variable 'tramp-ssh-controlmaster-options
                        "-o ControlMaster=auto -o ControlPath='tramp.%%r@%%h:%%p' -o ControlPersist=yes")
#+end_src

* Corfu
#+begin_src emacs-lisp
(after! corfu
  (setq corfu-auto t
        corfu-auto-delay 0.0
        corfu-auto-prefix 1)

  ;; Merge snippets into the completion list
  (add-hook 'lsp-mode-hook
            (lambda ()
              (setq-local completion-at-point-functions
                          (list (cape-capf-super
                                 #'lsp-completion-at-point
                                 #'yasnippet-capf
                                 #'cape-file))))))
#+end_src

* Dashboard
#+begin_src emacs-lisp
(use-package! dashboard
  :init
   (setq initial-buffer-choice 'dashboard-open)
   (setq doom-fallback-buffer-name "*dashboard*")
   (add-hook 'doom-enter-frame-hook #'dashboard-open)
   (setq dashboard-startup-banner 'logo)
   (setq dashboard-banner-logo-title "Greetings, hack!")
   (setq dashboard-set-heading-icons t)
   (setq dashboard-footer-icon "☠")
   (setq dashboard-footer-messages '("Eat, Sleep, Hack, Repeat..."))
   (setq initial-scratch-message nil)
  :config
   (dashboard-setup-startup-hook))
#+end_src

* Evil Options
#+begin_src emacs-lisp
(setq evil-default-cursor 'box
      evil-normal-state-cursor 'box
      evil-insert-state-cursor 'box
      evil-visual-state-cursor 'box
      evil-vsplit-window-right t
      evil-split-window-below t
      select-enable-clipboard nil
      select-enable-primary nil
      evil-undo-system 'undo-redo)
#+end_src

* LSP Mode Optimization
#+begin_src emacs-lisp
(after! flycheck
  (setq flycheck-idle-change-delay 0.1))

(after! lsp-mode
  (setq lsp-idle-delay 0.1
        lsp-completion-enable-additional-text-edit t
        lsp-modeline-code-actions-enable t
        lsp-auto-guess-root t))
#+end_src

* Solaire Mode
#+begin_src emacs-lisp
(after! solaire-mode
  (custom-set-faces!
    `(solaire-default-face :background ,(doom-color 'bg))))
#+end_src

* UI Tweaks

#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(undecorated . t))
(setq scroll-margin 8)
#+end_src
